{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import pandas as pd\n",
    "\n",
    "from IPython.core.interactiveshell import InteractiveShell\n",
    "InteractiveShell.ast_node_interactivity = \"all\"\n",
    "\n",
    "import re\n",
    "import datetime \n",
    "import numpy as np"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "events = pd.read_csv(\"patients.csv\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>patient_id</th>\n",
       "      <th>event_id</th>\n",
       "      <th>start_date</th>\n",
       "      <th>end_date</th>\n",
       "      <th>event_type</th>\n",
       "      <th>opcs4</th>\n",
       "      <th>opcs4_desc</th>\n",
       "      <th>icd10</th>\n",
       "      <th>icd10_desc</th>\n",
       "      <th>test_type</th>\n",
       "      <th>notes</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>patient_001</td>\n",
       "      <td>event_001</td>\n",
       "      <td>10/10/2021 12:30</td>\n",
       "      <td>10/10/2021 12:30</td>\n",
       "      <td>test</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>FIT</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>patient_001</td>\n",
       "      <td>event_002</td>\n",
       "      <td>15/10/2021 10:00</td>\n",
       "      <td>15/10/2021 10:00</td>\n",
       "      <td>referral</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>patient_001</td>\n",
       "      <td>event_003</td>\n",
       "      <td>15/10/2021 10:00</td>\n",
       "      <td>15/10/2021 10:00</td>\n",
       "      <td>diagnosis</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>C183</td>\n",
       "      <td>Malignant neoplasm of colon: Hepatic flexure</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>patient_001</td>\n",
       "      <td>event_004</td>\n",
       "      <td>30/10/2021 12:00</td>\n",
       "      <td>30/10/2021 12:00</td>\n",
       "      <td>procedure</td>\n",
       "      <td>H083</td>\n",
       "      <td>Transverse colectomy and anastomosis NEC</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>surgery</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>patient_001</td>\n",
       "      <td>event_005</td>\n",
       "      <td>03/11/2021 13:15</td>\n",
       "      <td>03/11/2021 13:15</td>\n",
       "      <td>procedure</td>\n",
       "      <td>X352</td>\n",
       "      <td>Intraveneous chemotherapy</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>chemo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>patient_001</td>\n",
       "      <td>event_006</td>\n",
       "      <td>05/11/2021 14:00</td>\n",
       "      <td>05/11/2021 14:00</td>\n",
       "      <td>procedure</td>\n",
       "      <td>X352</td>\n",
       "      <td>Intraveneous chemotherapy</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>chemo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>patient_001</td>\n",
       "      <td>event_007</td>\n",
       "      <td>01/12/2021 14:00</td>\n",
       "      <td>01/12/2021 14:00</td>\n",
       "      <td>procedure</td>\n",
       "      <td>X352</td>\n",
       "      <td>Intraveneous chemotherapy</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>chemo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>patient_002</td>\n",
       "      <td>event_008</td>\n",
       "      <td>01/01/20001 12:00</td>\n",
       "      <td>01/01/2001 12:00</td>\n",
       "      <td>test</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>FIT</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>patient_002</td>\n",
       "      <td>event_009</td>\n",
       "      <td>01/01/20001 12:01</td>\n",
       "      <td>02/01/2001 12:00</td>\n",
       "      <td>referral</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>patient_002</td>\n",
       "      <td>event_010</td>\n",
       "      <td>01/01/20001 12:02</td>\n",
       "      <td>03/01/2001 12:00</td>\n",
       "      <td>diagnosis</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>C20</td>\n",
       "      <td>Malignan neoplasm of rectum</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>patient_002</td>\n",
       "      <td>event_011</td>\n",
       "      <td>01/01/20001 12:03</td>\n",
       "      <td>04/01/2001 12:00</td>\n",
       "      <td>procedure</td>\n",
       "      <td>X701</td>\n",
       "      <td>Procurement of drugs for chemotherapy for neop...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>chemo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>patient_002</td>\n",
       "      <td>event_012</td>\n",
       "      <td>01/01/20001 12:04</td>\n",
       "      <td>05/01/2001 12:00</td>\n",
       "      <td>procedure</td>\n",
       "      <td>H073</td>\n",
       "      <td>Right hemicolectomy and anastomosis NEC</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>surgery</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>patient_002</td>\n",
       "      <td>event_013</td>\n",
       "      <td>01/01/20001 12:05</td>\n",
       "      <td>06/01/2001 12:00</td>\n",
       "      <td>procedure</td>\n",
       "      <td>X701</td>\n",
       "      <td>Procurement of drugs for chemotherapy for neop...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>chemo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>patient_003</td>\n",
       "      <td>event_014</td>\n",
       "      <td>01/01/20001 12:06</td>\n",
       "      <td>07/01/2001 12:00</td>\n",
       "      <td>procedure</td>\n",
       "      <td>H333</td>\n",
       "      <td>Anterior resection of rectum and anastomosis o...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>patient_003</td>\n",
       "      <td>event_015</td>\n",
       "      <td>01/01/20001 12:07</td>\n",
       "      <td>08/01/2001 12:00</td>\n",
       "      <td>diagnosis</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>C19</td>\n",
       "      <td>Malignant neoplasm of rectosigmoid junction</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>patient_003</td>\n",
       "      <td>event_016</td>\n",
       "      <td>01/01/20001 12:08</td>\n",
       "      <td>09/01/2001 12:00</td>\n",
       "      <td>procedure</td>\n",
       "      <td>X712</td>\n",
       "      <td>Procurement of drugs for chemotherapy for neop...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     patient_id   event_id         start_date          end_date event_type  \\\n",
       "0   patient_001  event_001   10/10/2021 12:30  10/10/2021 12:30       test   \n",
       "1   patient_001  event_002   15/10/2021 10:00  15/10/2021 10:00   referral   \n",
       "2   patient_001  event_003   15/10/2021 10:00  15/10/2021 10:00  diagnosis   \n",
       "3   patient_001  event_004   30/10/2021 12:00  30/10/2021 12:00  procedure   \n",
       "4   patient_001  event_005   03/11/2021 13:15  03/11/2021 13:15  procedure   \n",
       "5   patient_001  event_006   05/11/2021 14:00  05/11/2021 14:00  procedure   \n",
       "6   patient_001  event_007   01/12/2021 14:00  01/12/2021 14:00  procedure   \n",
       "7   patient_002  event_008  01/01/20001 12:00  01/01/2001 12:00       test   \n",
       "8   patient_002  event_009  01/01/20001 12:01  02/01/2001 12:00   referral   \n",
       "9   patient_002  event_010  01/01/20001 12:02  03/01/2001 12:00  diagnosis   \n",
       "10  patient_002  event_011  01/01/20001 12:03  04/01/2001 12:00  procedure   \n",
       "11  patient_002  event_012  01/01/20001 12:04  05/01/2001 12:00  procedure   \n",
       "12  patient_002  event_013  01/01/20001 12:05  06/01/2001 12:00  procedure   \n",
       "13  patient_003  event_014  01/01/20001 12:06  07/01/2001 12:00  procedure   \n",
       "14  patient_003  event_015  01/01/20001 12:07  08/01/2001 12:00  diagnosis   \n",
       "15  patient_003  event_016  01/01/20001 12:08  09/01/2001 12:00  procedure   \n",
       "\n",
       "   opcs4                                         opcs4_desc icd10  \\\n",
       "0    NaN                                                NaN   NaN   \n",
       "1    NaN                                                NaN   NaN   \n",
       "2    NaN                                                NaN  C183   \n",
       "3   H083           Transverse colectomy and anastomosis NEC   NaN   \n",
       "4   X352                          Intraveneous chemotherapy   NaN   \n",
       "5   X352                          Intraveneous chemotherapy   NaN   \n",
       "6   X352                          Intraveneous chemotherapy   NaN   \n",
       "7    NaN                                                NaN   NaN   \n",
       "8    NaN                                                NaN   NaN   \n",
       "9    NaN                                                NaN   C20   \n",
       "10  X701  Procurement of drugs for chemotherapy for neop...   NaN   \n",
       "11  H073           Right hemicolectomy and anastomosis NEC    NaN   \n",
       "12  X701  Procurement of drugs for chemotherapy for neop...   NaN   \n",
       "13  H333  Anterior resection of rectum and anastomosis o...   NaN   \n",
       "14   NaN                                                NaN   C19   \n",
       "15  X712  Procurement of drugs for chemotherapy for neop...   NaN   \n",
       "\n",
       "                                      icd10_desc test_type    notes  \n",
       "0                                            NaN       FIT      NaN  \n",
       "1                                            NaN       NaN      NaN  \n",
       "2   Malignant neoplasm of colon: Hepatic flexure       NaN      NaN  \n",
       "3                                            NaN       NaN  surgery  \n",
       "4                                            NaN       NaN    chemo  \n",
       "5                                            NaN       NaN    chemo  \n",
       "6                                            NaN       NaN    chemo  \n",
       "7                                            NaN       FIT      NaN  \n",
       "8                                            NaN       NaN      NaN  \n",
       "9                    Malignan neoplasm of rectum       NaN      NaN  \n",
       "10                                           NaN       NaN    chemo  \n",
       "11                                           NaN       NaN  surgery  \n",
       "12                                           NaN       NaN    chemo  \n",
       "13                                           NaN       NaN      NaN  \n",
       "14   Malignant neoplasm of rectosigmoid junction       NaN      NaN  \n",
       "15                                           NaN       NaN      NaN  "
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "events"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>subject</th>\n",
       "      <th>predicate</th>\n",
       "      <th>object</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>patient_001</td>\n",
       "      <td>hasEvent</td>\n",
       "      <td>event_001</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>patient_001</td>\n",
       "      <td>hasEvent</td>\n",
       "      <td>event_002</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>patient_001</td>\n",
       "      <td>hasEvent</td>\n",
       "      <td>event_003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>patient_001</td>\n",
       "      <td>hasEvent</td>\n",
       "      <td>event_004</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>patient_001</td>\n",
       "      <td>hasEvent</td>\n",
       "      <td>event_005</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       subject predicate     object\n",
       "0  patient_001  hasEvent  event_001\n",
       "1  patient_001  hasEvent  event_002\n",
       "2  patient_001  hasEvent  event_003\n",
       "3  patient_001  hasEvent  event_004\n",
       "4  patient_001  hasEvent  event_005"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>subject</th>\n",
       "      <th>predicate</th>\n",
       "      <th>object</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>event_001</td>\n",
       "      <td>hasDiagnosis</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>event_002</td>\n",
       "      <td>hasDiagnosis</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>event_003</td>\n",
       "      <td>hasDiagnosis</td>\n",
       "      <td>C183</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>event_004</td>\n",
       "      <td>hasDiagnosis</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>event_005</td>\n",
       "      <td>hasDiagnosis</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     subject     predicate object\n",
       "0  event_001  hasDiagnosis    NaN\n",
       "1  event_002  hasDiagnosis    NaN\n",
       "2  event_003  hasDiagnosis   C183\n",
       "3  event_004  hasDiagnosis    NaN\n",
       "4  event_005  hasDiagnosis    NaN"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>subject</th>\n",
       "      <th>predicate</th>\n",
       "      <th>object</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>event_001</td>\n",
       "      <td>ofType</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>event_002</td>\n",
       "      <td>ofType</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>event_003</td>\n",
       "      <td>ofType</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>event_004</td>\n",
       "      <td>ofType</td>\n",
       "      <td>H083</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>event_005</td>\n",
       "      <td>ofType</td>\n",
       "      <td>X352</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     subject predicate object\n",
       "0  event_001    ofType    NaN\n",
       "1  event_002    ofType    NaN\n",
       "2  event_003    ofType    NaN\n",
       "3  event_004    ofType   H083\n",
       "4  event_005    ofType   X352"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "hasEvent = pd.DataFrame({ 'subject':events['patient_id'],\n",
    "                          'predicate':\"hasEvent\",\n",
    "                          'object':events['event_id']})\n",
    "hasEvent = hasEvent.drop_duplicates()\n",
    "hasEvent.head()\n",
    "\n",
    "hasDiagnosis = pd.DataFrame({ 'subject':events['event_id'],\n",
    "                          'predicate':\"hasDiagnosis\",\n",
    "                          'object':events['icd10']})\n",
    "hasDiagnosis = hasDiagnosis.drop_duplicates()\n",
    "hasDiagnosis.head()\n",
    "\n",
    "ofType = pd.DataFrame({ 'subject':events['event_id'],\n",
    "                          'predicate':\"ofType\",\n",
    "                          'object':events['opcs4']})\n",
    "ofType = ofType.drop_duplicates()\n",
    "ofType.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>subject</th>\n",
       "      <th>predicate</th>\n",
       "      <th>object</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>H083</td>\n",
       "      <td>inCategory</td>\n",
       "      <td>H08</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>H08</td>\n",
       "      <td>inCategory</td>\n",
       "      <td>procedures_H Lower Digestive Tract</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>X352</td>\n",
       "      <td>inCategory</td>\n",
       "      <td>X35</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>X35</td>\n",
       "      <td>inCategory</td>\n",
       "      <td>procedures_X Miscellaneous Operations</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>X701</td>\n",
       "      <td>inCategory</td>\n",
       "      <td>X70</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  subject   predicate                                 object\n",
       "0    H083  inCategory                                    H08\n",
       "1     H08  inCategory     procedures_H Lower Digestive Tract\n",
       "2    X352  inCategory                                    X35\n",
       "3     X35  inCategory  procedures_X Miscellaneous Operations\n",
       "4    X701  inCategory                                    X70"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "OPCS_DICT = {\n",
    "    'A':'A Nervous System',\n",
    "    'B':'B Endocrine System and Breast',\n",
    "    'C':'C Eye',\n",
    "    'D':'E Ear',\n",
    "    'E':'F Respiratory Tract',\n",
    "    'G':'G Upper Digestive Tract',\n",
    "    'H':'H Lower Digestive Tract',\n",
    "    'J':'J Other Abdominal Organs – Principally Digestive',\n",
    "    'K':'K Heart',\n",
    "    'L':'L Arteries and Veins',\n",
    "    'M':'M Urinary', \n",
    "    'N':'N Male Genital Organs',\n",
    "    'P':'P Lower Female Genital Tract',\n",
    "    'Q':'Q Upper Female Genital Tract',\n",
    "    'R':'R Female Genital Tract Associated with Pregnancy, Childbirth and Puerperium',\n",
    "    'S':'S Skin',\n",
    "    'T':'T Soft Tissue',\n",
    "    'U':'U Diagnostic Imaging, Testing and Rehabilitation',\n",
    "    'V':'V Bones and Joints of Skull and Spine',\n",
    "    'W':'W Other Bones and Joints',\n",
    "    'X':'X Miscellaneous Operations',\n",
    "    'Y':'Y Subsidiary Classification of Methods of Operation',\n",
    "    'Z':'Z Subsidiary Classification of Sites of Operation'\n",
    "}\n",
    "\n",
    "def createOPCSTriples(df):\n",
    "    df = df.loc[ ~df.procedure_position.isna() ]\n",
    "\n",
    "    codeInCategory = []\n",
    "    for level_3 in df['procedure_code_opcs'].unique():\n",
    "        try:\n",
    "            level_1 = OPCS_DICT[level_3[0]] # First character = 1st level\n",
    "            level_2 = level_3[0:3]          #First 3 characters = 2nd level\n",
    "\n",
    "            codeInCategory.append([level_3,'inCategory',level_2])\n",
    "            codeInCategory.append([level_2,'inCategory','procedures_'+level_1])\n",
    "        except:\n",
    "            # do nothing if the code isn't found in the dictionary\n",
    "            pass\n",
    "\n",
    "    codeInCategory = pd.DataFrame(columns=['subject','predicate','object'], data=codeInCategory)\n",
    "    return codeInCategory\n",
    "\n",
    "events['procedure_code_opcs'] = events['opcs4']\n",
    "events['procedure_position'] = 1\n",
    "ontologyTriples = createOPCSTriples(events)\n",
    "ontologyTriples.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "<ipython-input-6-50df24e36431>:8: FutureWarning: The default value of regex will change from True to False in a future version.\n",
      "  ontologyTriples['object'] = ontologyTriples['object'].str.replace(\"[^0-9a-zA-Z]+\", \"_\")\n",
      "<ipython-input-6-50df24e36431>:9: FutureWarning: The default value of regex will change from True to False in a future version.\n",
      "  ontologyTriples['subject'] = ontologyTriples['subject'].str.replace(\"[^0-9a-zA-Z]+\", \"_\")\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>subject</th>\n",
       "      <th>predicate</th>\n",
       "      <th>object</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>H083</td>\n",
       "      <td>inCategory</td>\n",
       "      <td>H08</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>H08</td>\n",
       "      <td>inCategory</td>\n",
       "      <td>procedures_H_Lower_Digestive_Tract</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>X352</td>\n",
       "      <td>inCategory</td>\n",
       "      <td>X35</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>X35</td>\n",
       "      <td>inCategory</td>\n",
       "      <td>procedures_X_Miscellaneous_Operations</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>X701</td>\n",
       "      <td>inCategory</td>\n",
       "      <td>X70</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>X70</td>\n",
       "      <td>inCategory</td>\n",
       "      <td>procedures_X_Miscellaneous_Operations</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>H073</td>\n",
       "      <td>inCategory</td>\n",
       "      <td>H07</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>H07</td>\n",
       "      <td>inCategory</td>\n",
       "      <td>procedures_H_Lower_Digestive_Tract</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>H333</td>\n",
       "      <td>inCategory</td>\n",
       "      <td>H33</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>H33</td>\n",
       "      <td>inCategory</td>\n",
       "      <td>procedures_H_Lower_Digestive_Tract</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>X712</td>\n",
       "      <td>inCategory</td>\n",
       "      <td>X71</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>X71</td>\n",
       "      <td>inCategory</td>\n",
       "      <td>procedures_X_Miscellaneous_Operations</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>procedures_H_Lower_Digestive_Tract</td>\n",
       "      <td>ofType</td>\n",
       "      <td>procedures</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>procedures_X_Miscellaneous_Operations</td>\n",
       "      <td>ofType</td>\n",
       "      <td>procedures</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>procedures_X_Miscellaneous_Operations</td>\n",
       "      <td>ofType</td>\n",
       "      <td>procedures</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>procedures_H_Lower_Digestive_Tract</td>\n",
       "      <td>ofType</td>\n",
       "      <td>procedures</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>procedures_H_Lower_Digestive_Tract</td>\n",
       "      <td>ofType</td>\n",
       "      <td>procedures</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>procedures_X_Miscellaneous_Operations</td>\n",
       "      <td>ofType</td>\n",
       "      <td>procedures</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                  subject   predicate  \\\n",
       "0                                    H083  inCategory   \n",
       "1                                     H08  inCategory   \n",
       "2                                    X352  inCategory   \n",
       "3                                     X35  inCategory   \n",
       "4                                    X701  inCategory   \n",
       "5                                     X70  inCategory   \n",
       "6                                    H073  inCategory   \n",
       "7                                     H07  inCategory   \n",
       "8                                    H333  inCategory   \n",
       "9                                     H33  inCategory   \n",
       "10                                   X712  inCategory   \n",
       "11                                    X71  inCategory   \n",
       "1      procedures_H_Lower_Digestive_Tract      ofType   \n",
       "3   procedures_X_Miscellaneous_Operations      ofType   \n",
       "5   procedures_X_Miscellaneous_Operations      ofType   \n",
       "7      procedures_H_Lower_Digestive_Tract      ofType   \n",
       "9      procedures_H_Lower_Digestive_Tract      ofType   \n",
       "11  procedures_X_Miscellaneous_Operations      ofType   \n",
       "\n",
       "                                   object  \n",
       "0                                     H08  \n",
       "1      procedures_H_Lower_Digestive_Tract  \n",
       "2                                     X35  \n",
       "3   procedures_X_Miscellaneous_Operations  \n",
       "4                                     X70  \n",
       "5   procedures_X_Miscellaneous_Operations  \n",
       "6                                     H07  \n",
       "7      procedures_H_Lower_Digestive_Tract  \n",
       "8                                     H33  \n",
       "9      procedures_H_Lower_Digestive_Tract  \n",
       "10                                    X71  \n",
       "11  procedures_X_Miscellaneous_Operations  \n",
       "1                              procedures  \n",
       "3                              procedures  \n",
       "5                              procedures  \n",
       "7                              procedures  \n",
       "9                              procedures  \n",
       "11                             procedures  "
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "opcs_cats = ontologyTriples[ ontologyTriples['object'].str.startswith('procedures_')]['object'] #Get highest level OPCS codes\n",
    "\n",
    "ontologyRoot = pd.DataFrame({ 'subject':opcs_cats,\n",
    "                          'predicate':\"ofType\",\n",
    "                          'object':'procedures'} )\n",
    "ontologyTriples = ontologyTriples.append(ontologyRoot)\n",
    "\n",
    "ontologyTriples['object'] = ontologyTriples['object'].str.replace(\"[^0-9a-zA-Z]+\", \"_\")\n",
    "ontologyTriples['subject'] = ontologyTriples['subject'].str.replace(\"[^0-9a-zA-Z]+\", \"_\")\n",
    "\n",
    "ontologyTriples\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "scrolled": false
   },
   "outputs": [],
   "source": [
    "uri             = \"neo4j+s://1069e392.databases.neo4j.io\"\n",
    "\n",
    "userName        = \"neo4j\"\n",
    "\n",
    "password        = \"C315QwpDKsTlYkp1vC78I0kZTvO5x8RuHcHPhyUla7Y\"\n",
    "\n",
    "graphDB_Driver  = GraphDatabase.driver(uri, auth=(userName, password)) "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>subject</th>\n",
       "      <th>predicate</th>\n",
       "      <th>object</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>event_001</td>\n",
       "      <td>precedes</td>\n",
       "      <td>event_002</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>event_002</td>\n",
       "      <td>precedes</td>\n",
       "      <td>event_003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>event_003</td>\n",
       "      <td>precedes</td>\n",
       "      <td>event_004</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>event_004</td>\n",
       "      <td>precedes</td>\n",
       "      <td>event_005</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>event_005</td>\n",
       "      <td>precedes</td>\n",
       "      <td>event_006</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     subject predicate     object\n",
       "0  event_001  precedes  event_002\n",
       "1  event_002  precedes  event_003\n",
       "2  event_003  precedes  event_004\n",
       "3  event_004  precedes  event_005\n",
       "4  event_005  precedes  event_006"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "def getPrecedesTriples(all_events):\n",
    "    \n",
    "    all_patients = all_events['patient_id'].unique()\n",
    "    eventPrecedesEvent = pd.DataFrame({ 'subject':[], 'predicate':[], 'object':[]})\n",
    "\n",
    "    for p in all_patients:\n",
    "        #patient_events = all_events[ (all_events['patient_id']==p) & (~all_events['procedure_code_opcs'].isna()) ]\n",
    "        #patient_codes = patient_events['procedure_code_opcs'].tolist()\n",
    "\n",
    "        patient_events = all_events[ (all_events['patient_id']==p) ]\n",
    "\n",
    "        triples = pd.DataFrame({ 'subject':patient_events['event_id'].astype(str),\n",
    "                             'predicate':\"precedes\",\n",
    "                             'object':patient_events['event_id'].astype(str) })\n",
    "\n",
    "        triples['object'] = triples['object'].shift(-1)\n",
    "        triples = triples.drop(triples.tail(1).index) \n",
    "\n",
    "        eventPrecedesEvent = eventPrecedesEvent.append(triples)\n",
    "    return eventPrecedesEvent\n",
    "\n",
    "sequenceTriples = getPrecedesTriples(events)\n",
    "sequenceTriples.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "\n",
    "\n",
    "def addTriples(triple_df, subject_type, object_type  ):\n",
    "    with graphDB_Driver.session() as graphDB_Session:\n",
    "        for index,row in triple_df.iterrows():\n",
    "            a = \"\"\"MERGE (%(subject_val)s:%(subject_type)s {name:\"%(subject_val)s\"}) \"\"\"  % {'subject_val':  row['subject'],\n",
    "           'subject_type': subject_type}\n",
    "\n",
    "            b = \"\"\"MERGE (%(object_val)s:%(object_type)s {name:\"%(object_val)s\"}) \"\"\"% {'object_val':  row['object'],\n",
    "                               'object_type': object_type}\n",
    "\n",
    "            c = \"\"\" MATCH (a:%(subject_type)s),(b:%(object_type)s) \n",
    "                    WHERE a.name = \"%(subject_val)s\" \n",
    "                      AND b.name = \"%(object_val)s\"\n",
    "                    MERGE (a)\n",
    "                        -[r:%(relationship)s]->(b) \n",
    "                    RETURN type(r)\n",
    "                \"\"\"% {'subject_val':  row['subject'],\n",
    "                   'object_val': row['object'],\n",
    "                   'subject_type':subject_type,\n",
    "                   'object_type': object_type,\n",
    "                   'relationship': row['predicate']}\n",
    "            print(a)\n",
    "            graphDB_Session.run(a)\n",
    "            print(b)\n",
    "            graphDB_Session.run(b)\n",
    "            print(c)\n",
    "            graphDB_Session.run(c)\n",
    "\n",
    "            \n",
    "            #print(a)\n",
    "            #print(b)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MERGE (patient_001:patient {name:\"patient_001\"}) \n",
      "MERGE (event_001:event {name:\"event_001\"}) \n",
      " MATCH (a:patient),(b:event) \n",
      "                    WHERE a.name = \"patient_001\" \n",
      "                      AND b.name = \"event_001\"\n",
      "                    MERGE (a)\n",
      "                        -[r:hasEvent]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (patient_001:patient {name:\"patient_001\"}) \n",
      "MERGE (event_002:event {name:\"event_002\"}) \n",
      " MATCH (a:patient),(b:event) \n",
      "                    WHERE a.name = \"patient_001\" \n",
      "                      AND b.name = \"event_002\"\n",
      "                    MERGE (a)\n",
      "                        -[r:hasEvent]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (patient_001:patient {name:\"patient_001\"}) \n",
      "MERGE (event_003:event {name:\"event_003\"}) \n",
      " MATCH (a:patient),(b:event) \n",
      "                    WHERE a.name = \"patient_001\" \n",
      "                      AND b.name = \"event_003\"\n",
      "                    MERGE (a)\n",
      "                        -[r:hasEvent]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (patient_001:patient {name:\"patient_001\"}) \n",
      "MERGE (event_004:event {name:\"event_004\"}) \n",
      " MATCH (a:patient),(b:event) \n",
      "                    WHERE a.name = \"patient_001\" \n",
      "                      AND b.name = \"event_004\"\n",
      "                    MERGE (a)\n",
      "                        -[r:hasEvent]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (patient_001:patient {name:\"patient_001\"}) \n",
      "MERGE (event_005:event {name:\"event_005\"}) \n",
      " MATCH (a:patient),(b:event) \n",
      "                    WHERE a.name = \"patient_001\" \n",
      "                      AND b.name = \"event_005\"\n",
      "                    MERGE (a)\n",
      "                        -[r:hasEvent]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (patient_001:patient {name:\"patient_001\"}) \n",
      "MERGE (event_006:event {name:\"event_006\"}) \n",
      " MATCH (a:patient),(b:event) \n",
      "                    WHERE a.name = \"patient_001\" \n",
      "                      AND b.name = \"event_006\"\n",
      "                    MERGE (a)\n",
      "                        -[r:hasEvent]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (patient_001:patient {name:\"patient_001\"}) \n",
      "MERGE (event_007:event {name:\"event_007\"}) \n",
      " MATCH (a:patient),(b:event) \n",
      "                    WHERE a.name = \"patient_001\" \n",
      "                      AND b.name = \"event_007\"\n",
      "                    MERGE (a)\n",
      "                        -[r:hasEvent]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (patient_002:patient {name:\"patient_002\"}) \n",
      "MERGE (event_008:event {name:\"event_008\"}) \n",
      " MATCH (a:patient),(b:event) \n",
      "                    WHERE a.name = \"patient_002\" \n",
      "                      AND b.name = \"event_008\"\n",
      "                    MERGE (a)\n",
      "                        -[r:hasEvent]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (patient_002:patient {name:\"patient_002\"}) \n",
      "MERGE (event_009:event {name:\"event_009\"}) \n",
      " MATCH (a:patient),(b:event) \n",
      "                    WHERE a.name = \"patient_002\" \n",
      "                      AND b.name = \"event_009\"\n",
      "                    MERGE (a)\n",
      "                        -[r:hasEvent]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (patient_002:patient {name:\"patient_002\"}) \n",
      "MERGE (event_010:event {name:\"event_010\"}) \n",
      " MATCH (a:patient),(b:event) \n",
      "                    WHERE a.name = \"patient_002\" \n",
      "                      AND b.name = \"event_010\"\n",
      "                    MERGE (a)\n",
      "                        -[r:hasEvent]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (patient_002:patient {name:\"patient_002\"}) \n",
      "MERGE (event_011:event {name:\"event_011\"}) \n",
      " MATCH (a:patient),(b:event) \n",
      "                    WHERE a.name = \"patient_002\" \n",
      "                      AND b.name = \"event_011\"\n",
      "                    MERGE (a)\n",
      "                        -[r:hasEvent]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (patient_002:patient {name:\"patient_002\"}) \n",
      "MERGE (event_012:event {name:\"event_012\"}) \n",
      " MATCH (a:patient),(b:event) \n",
      "                    WHERE a.name = \"patient_002\" \n",
      "                      AND b.name = \"event_012\"\n",
      "                    MERGE (a)\n",
      "                        -[r:hasEvent]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (patient_002:patient {name:\"patient_002\"}) \n",
      "MERGE (event_013:event {name:\"event_013\"}) \n",
      " MATCH (a:patient),(b:event) \n",
      "                    WHERE a.name = \"patient_002\" \n",
      "                      AND b.name = \"event_013\"\n",
      "                    MERGE (a)\n",
      "                        -[r:hasEvent]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (patient_003:patient {name:\"patient_003\"}) \n",
      "MERGE (event_014:event {name:\"event_014\"}) \n",
      " MATCH (a:patient),(b:event) \n",
      "                    WHERE a.name = \"patient_003\" \n",
      "                      AND b.name = \"event_014\"\n",
      "                    MERGE (a)\n",
      "                        -[r:hasEvent]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (patient_003:patient {name:\"patient_003\"}) \n",
      "MERGE (event_015:event {name:\"event_015\"}) \n",
      " MATCH (a:patient),(b:event) \n",
      "                    WHERE a.name = \"patient_003\" \n",
      "                      AND b.name = \"event_015\"\n",
      "                    MERGE (a)\n",
      "                        -[r:hasEvent]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (patient_003:patient {name:\"patient_003\"}) \n",
      "MERGE (event_016:event {name:\"event_016\"}) \n",
      " MATCH (a:patient),(b:event) \n",
      "                    WHERE a.name = \"patient_003\" \n",
      "                      AND b.name = \"event_016\"\n",
      "                    MERGE (a)\n",
      "                        -[r:hasEvent]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (event_003:event {name:\"event_003\"}) \n",
      "MERGE (C183:diagnosis {name:\"C183\"}) \n",
      " MATCH (a:event),(b:diagnosis) \n",
      "                    WHERE a.name = \"event_003\" \n",
      "                      AND b.name = \"C183\"\n",
      "                    MERGE (a)\n",
      "                        -[r:hasDiagnosis]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (event_010:event {name:\"event_010\"}) \n",
      "MERGE (C20:diagnosis {name:\"C20\"}) \n",
      " MATCH (a:event),(b:diagnosis) \n",
      "                    WHERE a.name = \"event_010\" \n",
      "                      AND b.name = \"C20\"\n",
      "                    MERGE (a)\n",
      "                        -[r:hasDiagnosis]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (event_015:event {name:\"event_015\"}) \n",
      "MERGE (C19:diagnosis {name:\"C19\"}) \n",
      " MATCH (a:event),(b:diagnosis) \n",
      "                    WHERE a.name = \"event_015\" \n",
      "                      AND b.name = \"C19\"\n",
      "                    MERGE (a)\n",
      "                        -[r:hasDiagnosis]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (event_004:event {name:\"event_004\"}) \n",
      "MERGE (H083:opcs4 {name:\"H083\"}) \n",
      " MATCH (a:event),(b:opcs4) \n",
      "                    WHERE a.name = \"event_004\" \n",
      "                      AND b.name = \"H083\"\n",
      "                    MERGE (a)\n",
      "                        -[r:ofType]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (event_005:event {name:\"event_005\"}) \n",
      "MERGE (X352:opcs4 {name:\"X352\"}) \n",
      " MATCH (a:event),(b:opcs4) \n",
      "                    WHERE a.name = \"event_005\" \n",
      "                      AND b.name = \"X352\"\n",
      "                    MERGE (a)\n",
      "                        -[r:ofType]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (event_006:event {name:\"event_006\"}) \n",
      "MERGE (X352:opcs4 {name:\"X352\"}) \n",
      " MATCH (a:event),(b:opcs4) \n",
      "                    WHERE a.name = \"event_006\" \n",
      "                      AND b.name = \"X352\"\n",
      "                    MERGE (a)\n",
      "                        -[r:ofType]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (event_007:event {name:\"event_007\"}) \n",
      "MERGE (X352:opcs4 {name:\"X352\"}) \n",
      " MATCH (a:event),(b:opcs4) \n",
      "                    WHERE a.name = \"event_007\" \n",
      "                      AND b.name = \"X352\"\n",
      "                    MERGE (a)\n",
      "                        -[r:ofType]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (event_011:event {name:\"event_011\"}) \n",
      "MERGE (X701:opcs4 {name:\"X701\"}) \n",
      " MATCH (a:event),(b:opcs4) \n",
      "                    WHERE a.name = \"event_011\" \n",
      "                      AND b.name = \"X701\"\n",
      "                    MERGE (a)\n",
      "                        -[r:ofType]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (event_012:event {name:\"event_012\"}) \n",
      "MERGE (H073:opcs4 {name:\"H073\"}) \n",
      " MATCH (a:event),(b:opcs4) \n",
      "                    WHERE a.name = \"event_012\" \n",
      "                      AND b.name = \"H073\"\n",
      "                    MERGE (a)\n",
      "                        -[r:ofType]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (event_013:event {name:\"event_013\"}) \n",
      "MERGE (X701:opcs4 {name:\"X701\"}) \n",
      " MATCH (a:event),(b:opcs4) \n",
      "                    WHERE a.name = \"event_013\" \n",
      "                      AND b.name = \"X701\"\n",
      "                    MERGE (a)\n",
      "                        -[r:ofType]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (event_014:event {name:\"event_014\"}) \n",
      "MERGE (H333:opcs4 {name:\"H333\"}) \n",
      " MATCH (a:event),(b:opcs4) \n",
      "                    WHERE a.name = \"event_014\" \n",
      "                      AND b.name = \"H333\"\n",
      "                    MERGE (a)\n",
      "                        -[r:ofType]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (event_016:event {name:\"event_016\"}) \n",
      "MERGE (X712:opcs4 {name:\"X712\"}) \n",
      " MATCH (a:event),(b:opcs4) \n",
      "                    WHERE a.name = \"event_016\" \n",
      "                      AND b.name = \"X712\"\n",
      "                    MERGE (a)\n",
      "                        -[r:ofType]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (H083:opcs4 {name:\"H083\"}) \n",
      "MERGE (H08:opcs4 {name:\"H08\"}) \n",
      " MATCH (a:opcs4),(b:opcs4) \n",
      "                    WHERE a.name = \"H083\" \n",
      "                      AND b.name = \"H08\"\n",
      "                    MERGE (a)\n",
      "                        -[r:inCategory]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (H08:opcs4 {name:\"H08\"}) \n",
      "MERGE (procedures_H_Lower_Digestive_Tract:opcs4 {name:\"procedures_H_Lower_Digestive_Tract\"}) \n",
      " MATCH (a:opcs4),(b:opcs4) \n",
      "                    WHERE a.name = \"H08\" \n",
      "                      AND b.name = \"procedures_H_Lower_Digestive_Tract\"\n",
      "                    MERGE (a)\n",
      "                        -[r:inCategory]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (X352:opcs4 {name:\"X352\"}) \n",
      "MERGE (X35:opcs4 {name:\"X35\"}) \n",
      " MATCH (a:opcs4),(b:opcs4) \n",
      "                    WHERE a.name = \"X352\" \n",
      "                      AND b.name = \"X35\"\n",
      "                    MERGE (a)\n",
      "                        -[r:inCategory]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (X35:opcs4 {name:\"X35\"}) \n",
      "MERGE (procedures_X_Miscellaneous_Operations:opcs4 {name:\"procedures_X_Miscellaneous_Operations\"}) \n",
      " MATCH (a:opcs4),(b:opcs4) \n",
      "                    WHERE a.name = \"X35\" \n",
      "                      AND b.name = \"procedures_X_Miscellaneous_Operations\"\n",
      "                    MERGE (a)\n",
      "                        -[r:inCategory]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (X701:opcs4 {name:\"X701\"}) \n",
      "MERGE (X70:opcs4 {name:\"X70\"}) \n",
      " MATCH (a:opcs4),(b:opcs4) \n",
      "                    WHERE a.name = \"X701\" \n",
      "                      AND b.name = \"X70\"\n",
      "                    MERGE (a)\n",
      "                        -[r:inCategory]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (X70:opcs4 {name:\"X70\"}) \n",
      "MERGE (procedures_X_Miscellaneous_Operations:opcs4 {name:\"procedures_X_Miscellaneous_Operations\"}) \n",
      " MATCH (a:opcs4),(b:opcs4) \n",
      "                    WHERE a.name = \"X70\" \n",
      "                      AND b.name = \"procedures_X_Miscellaneous_Operations\"\n",
      "                    MERGE (a)\n",
      "                        -[r:inCategory]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (H073:opcs4 {name:\"H073\"}) \n",
      "MERGE (H07:opcs4 {name:\"H07\"}) \n",
      " MATCH (a:opcs4),(b:opcs4) \n",
      "                    WHERE a.name = \"H073\" \n",
      "                      AND b.name = \"H07\"\n",
      "                    MERGE (a)\n",
      "                        -[r:inCategory]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (H07:opcs4 {name:\"H07\"}) \n",
      "MERGE (procedures_H_Lower_Digestive_Tract:opcs4 {name:\"procedures_H_Lower_Digestive_Tract\"}) \n",
      " MATCH (a:opcs4),(b:opcs4) \n",
      "                    WHERE a.name = \"H07\" \n",
      "                      AND b.name = \"procedures_H_Lower_Digestive_Tract\"\n",
      "                    MERGE (a)\n",
      "                        -[r:inCategory]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (H333:opcs4 {name:\"H333\"}) \n",
      "MERGE (H33:opcs4 {name:\"H33\"}) \n",
      " MATCH (a:opcs4),(b:opcs4) \n",
      "                    WHERE a.name = \"H333\" \n",
      "                      AND b.name = \"H33\"\n",
      "                    MERGE (a)\n",
      "                        -[r:inCategory]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (H33:opcs4 {name:\"H33\"}) \n",
      "MERGE (procedures_H_Lower_Digestive_Tract:opcs4 {name:\"procedures_H_Lower_Digestive_Tract\"}) \n",
      " MATCH (a:opcs4),(b:opcs4) \n",
      "                    WHERE a.name = \"H33\" \n",
      "                      AND b.name = \"procedures_H_Lower_Digestive_Tract\"\n",
      "                    MERGE (a)\n",
      "                        -[r:inCategory]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (X712:opcs4 {name:\"X712\"}) \n",
      "MERGE (X71:opcs4 {name:\"X71\"}) \n",
      " MATCH (a:opcs4),(b:opcs4) \n",
      "                    WHERE a.name = \"X712\" \n",
      "                      AND b.name = \"X71\"\n",
      "                    MERGE (a)\n",
      "                        -[r:inCategory]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (X71:opcs4 {name:\"X71\"}) \n",
      "MERGE (procedures_X_Miscellaneous_Operations:opcs4 {name:\"procedures_X_Miscellaneous_Operations\"}) \n",
      " MATCH (a:opcs4),(b:opcs4) \n",
      "                    WHERE a.name = \"X71\" \n",
      "                      AND b.name = \"procedures_X_Miscellaneous_Operations\"\n",
      "                    MERGE (a)\n",
      "                        -[r:inCategory]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (procedures_H_Lower_Digestive_Tract:opcs4 {name:\"procedures_H_Lower_Digestive_Tract\"}) \n",
      "MERGE (procedures:opcs4 {name:\"procedures\"}) \n",
      " MATCH (a:opcs4),(b:opcs4) \n",
      "                    WHERE a.name = \"procedures_H_Lower_Digestive_Tract\" \n",
      "                      AND b.name = \"procedures\"\n",
      "                    MERGE (a)\n",
      "                        -[r:ofType]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (procedures_X_Miscellaneous_Operations:opcs4 {name:\"procedures_X_Miscellaneous_Operations\"}) \n",
      "MERGE (procedures:opcs4 {name:\"procedures\"}) \n",
      " MATCH (a:opcs4),(b:opcs4) \n",
      "                    WHERE a.name = \"procedures_X_Miscellaneous_Operations\" \n",
      "                      AND b.name = \"procedures\"\n",
      "                    MERGE (a)\n",
      "                        -[r:ofType]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (procedures_X_Miscellaneous_Operations:opcs4 {name:\"procedures_X_Miscellaneous_Operations\"}) \n",
      "MERGE (procedures:opcs4 {name:\"procedures\"}) \n",
      " MATCH (a:opcs4),(b:opcs4) \n",
      "                    WHERE a.name = \"procedures_X_Miscellaneous_Operations\" \n",
      "                      AND b.name = \"procedures\"\n",
      "                    MERGE (a)\n",
      "                        -[r:ofType]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (procedures_H_Lower_Digestive_Tract:opcs4 {name:\"procedures_H_Lower_Digestive_Tract\"}) \n",
      "MERGE (procedures:opcs4 {name:\"procedures\"}) \n",
      " MATCH (a:opcs4),(b:opcs4) \n",
      "                    WHERE a.name = \"procedures_H_Lower_Digestive_Tract\" \n",
      "                      AND b.name = \"procedures\"\n",
      "                    MERGE (a)\n",
      "                        -[r:ofType]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (procedures_H_Lower_Digestive_Tract:opcs4 {name:\"procedures_H_Lower_Digestive_Tract\"}) \n",
      "MERGE (procedures:opcs4 {name:\"procedures\"}) \n",
      " MATCH (a:opcs4),(b:opcs4) \n",
      "                    WHERE a.name = \"procedures_H_Lower_Digestive_Tract\" \n",
      "                      AND b.name = \"procedures\"\n",
      "                    MERGE (a)\n",
      "                        -[r:ofType]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (procedures_X_Miscellaneous_Operations:opcs4 {name:\"procedures_X_Miscellaneous_Operations\"}) \n",
      "MERGE (procedures:opcs4 {name:\"procedures\"}) \n",
      " MATCH (a:opcs4),(b:opcs4) \n",
      "                    WHERE a.name = \"procedures_X_Miscellaneous_Operations\" \n",
      "                      AND b.name = \"procedures\"\n",
      "                    MERGE (a)\n",
      "                        -[r:ofType]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (event_001:event {name:\"event_001\"}) \n",
      "MERGE (event_002:event {name:\"event_002\"}) \n",
      " MATCH (a:event),(b:event) \n",
      "                    WHERE a.name = \"event_001\" \n",
      "                      AND b.name = \"event_002\"\n",
      "                    MERGE (a)\n",
      "                        -[r:precedes]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (event_002:event {name:\"event_002\"}) \n",
      "MERGE (event_003:event {name:\"event_003\"}) \n",
      " MATCH (a:event),(b:event) \n",
      "                    WHERE a.name = \"event_002\" \n",
      "                      AND b.name = \"event_003\"\n",
      "                    MERGE (a)\n",
      "                        -[r:precedes]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (event_003:event {name:\"event_003\"}) \n",
      "MERGE (event_004:event {name:\"event_004\"}) \n",
      " MATCH (a:event),(b:event) \n",
      "                    WHERE a.name = \"event_003\" \n",
      "                      AND b.name = \"event_004\"\n",
      "                    MERGE (a)\n",
      "                        -[r:precedes]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (event_004:event {name:\"event_004\"}) \n",
      "MERGE (event_005:event {name:\"event_005\"}) \n",
      " MATCH (a:event),(b:event) \n",
      "                    WHERE a.name = \"event_004\" \n",
      "                      AND b.name = \"event_005\"\n",
      "                    MERGE (a)\n",
      "                        -[r:precedes]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (event_005:event {name:\"event_005\"}) \n",
      "MERGE (event_006:event {name:\"event_006\"}) \n",
      " MATCH (a:event),(b:event) \n",
      "                    WHERE a.name = \"event_005\" \n",
      "                      AND b.name = \"event_006\"\n",
      "                    MERGE (a)\n",
      "                        -[r:precedes]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (event_006:event {name:\"event_006\"}) \n",
      "MERGE (event_007:event {name:\"event_007\"}) \n",
      " MATCH (a:event),(b:event) \n",
      "                    WHERE a.name = \"event_006\" \n",
      "                      AND b.name = \"event_007\"\n",
      "                    MERGE (a)\n",
      "                        -[r:precedes]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (event_008:event {name:\"event_008\"}) \n",
      "MERGE (event_009:event {name:\"event_009\"}) \n",
      " MATCH (a:event),(b:event) \n",
      "                    WHERE a.name = \"event_008\" \n",
      "                      AND b.name = \"event_009\"\n",
      "                    MERGE (a)\n",
      "                        -[r:precedes]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (event_009:event {name:\"event_009\"}) \n",
      "MERGE (event_010:event {name:\"event_010\"}) \n",
      " MATCH (a:event),(b:event) \n",
      "                    WHERE a.name = \"event_009\" \n",
      "                      AND b.name = \"event_010\"\n",
      "                    MERGE (a)\n",
      "                        -[r:precedes]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (event_010:event {name:\"event_010\"}) \n",
      "MERGE (event_011:event {name:\"event_011\"}) \n",
      " MATCH (a:event),(b:event) \n",
      "                    WHERE a.name = \"event_010\" \n",
      "                      AND b.name = \"event_011\"\n",
      "                    MERGE (a)\n",
      "                        -[r:precedes]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (event_011:event {name:\"event_011\"}) \n",
      "MERGE (event_012:event {name:\"event_012\"}) \n",
      " MATCH (a:event),(b:event) \n",
      "                    WHERE a.name = \"event_011\" \n",
      "                      AND b.name = \"event_012\"\n",
      "                    MERGE (a)\n",
      "                        -[r:precedes]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (event_012:event {name:\"event_012\"}) \n",
      "MERGE (event_013:event {name:\"event_013\"}) \n",
      " MATCH (a:event),(b:event) \n",
      "                    WHERE a.name = \"event_012\" \n",
      "                      AND b.name = \"event_013\"\n",
      "                    MERGE (a)\n",
      "                        -[r:precedes]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (event_014:event {name:\"event_014\"}) \n",
      "MERGE (event_015:event {name:\"event_015\"}) \n",
      " MATCH (a:event),(b:event) \n",
      "                    WHERE a.name = \"event_014\" \n",
      "                      AND b.name = \"event_015\"\n",
      "                    MERGE (a)\n",
      "                        -[r:precedes]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n",
      "MERGE (event_015:event {name:\"event_015\"}) \n",
      "MERGE (event_016:event {name:\"event_016\"}) \n",
      " MATCH (a:event),(b:event) \n",
      "                    WHERE a.name = \"event_015\" \n",
      "                      AND b.name = \"event_016\"\n",
      "                    MERGE (a)\n",
      "                        -[r:precedes]->(b) \n",
      "                    RETURN type(r)\n",
      "                \n"
     ]
    }
   ],
   "source": [
    "addTriples(hasEvent, 'patient', 'event')\n",
    "\n",
    "\n",
    "hasDiagnosis = hasDiagnosis.dropna()\n",
    "addTriples(hasDiagnosis, 'event', 'diagnosis')\n",
    "\n",
    "ofType = ofType.dropna()\n",
    "addTriples(ofType, 'event', 'opcs4')\n",
    "\n",
    "addTriples(ontologyTriples, 'opcs4', 'opcs4')\n",
    "addTriples(sequenceTriples, 'event', 'event')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#MATCH (n) DETACH DELETE n\n",
    "# wipe neo4j datanase"
   ]
  }
 ],
 "metadata": {
  "interpreter": {
   "hash": "b593f74c0676182fc4af200dc3032c4b015d690db7261292a70b8ce7ec28c975"
  },
  "kernelspec": {
   "display_name": "Python 3.8.8 64-bit ('base': conda)",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
